geValidSolid(OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks topology of a triangulated solid.
\param points [in]  Array of 3D points (in order of the triangles they form).
\param isValid [out]  Receives the validation result.
\param tol [in]  Geometric tolerance.
\remarks
Array of points should be divided by 3 without remainder.
Corresponding C++ library: TD_Ge